<?xml version="1.0" encoding="utf-8"?>
<packages>
  <package id="awscli" />
  <package id="bitwarden-cli" />
  <package id="azure-cli" />
  <package id="gsudo" />
  <package id="oh-my-posh" />
  <package id="plantuml" packageParameters="/NoShortcuts" />
  <package id="vim" packageParameters="/NoDesktopShortcuts" />
  <package id="editorconfig.core" />
  <package id="git" />
  <package id="kdiff3" />
  <package id="nodejs-lts" />
  <package id="neovim" />
  <package id="markdownlint-cli" />
  <package id="oh-my-posh" /> <!-- prompt -->
  <package id="zoxide" /> <!-- z command -->
  <package id="figlet-go" />
  <package id="fzf" /> <!-- fzf: "Fuzzy Finder" for fuzzy/partial filename matches -->
  <package id="ripgrep" /> <!-- rg: file contents search tool similar to grep -->
  <package id="python3" />
  <package id="webp" />
  <package id="sysinternals" />
  <package id="restic" />
  <package id="rclone.portable" />
  <package id="gallery-dl" />
  <package id="youtube-dl" />
  <package id="imagemagick.app" packageParameters="NoDesktop=true" />

  <!-- fonts -->
  <package id="cascadia-code-nerd-font" /> <!-- Patched CascadiaCode font w/powerline and wide char support -->
  <package id="dejavufonts" />
  <package id="hackfont" />
  <package id="SourceCodePro" />
  <package id="FiraCode" />
  <package id="Inconsolata" />

  <!-- Golang -->
  <package id="golang" />
  <package id="terraform" />
  <package id="powershell-core" />
-->
</packages>
