<?xml version="1.0" encoding="utf-8"?>
<packages>

  <package id="7zip" />
  <package id="anki" />

  <package id="awscli" />
  <package id="bitwarden-cli" />
  <package id="azure-cli" />
  <package id="gsudo" />
  <package id="oh-my-posh" />
  <package id="imagemagick.app" packageParameters="NoDesktop=true" />
  <package id="plantuml" packageParameters="/NoShortcuts" />
  <package id="vim" packageParameters="/NoDesktopShortcuts" />
  <package id="editorconfig.core" />
  <package id="git" />
  <package id="kdiff3" />
  <package id="nodejs-lts" />
  <package id="neovim" />
  <package id="markdownlint-cli" />
  <package id="oh-my-posh" /> <!-- prompt -->
  <package id="zoxide" /> <!-- z command -->
  <package id="figlet-go" />
  <package id="fzf" /> <!-- fzf: "Fuzzy Finder" for fuzzy/partial filename matches -->
  <package id="ripgrep" /> <!-- rg: file contents search tool similar to grep -->
  <package id="python3" />

  <!-- fonts -->
  <package id="cascadia-code-nerd-font" /> <!-- Patched CascadiaCode font w/powerline and wide char support -->
  <package id="dejavufonts" />
  <package id="hackfont" />
  <package id="SourceCodePro" />
  <package id="FiraCode" />
  <package id="Inconsolata" />

  <!--vscode-->
  <!--visualstudio2019community-->
  <!--<package id="golang" />-->
  <!--powershell-core-->
  <!--
chocolatey-… 1.10.0 1.10.2   false
dotnet-6.0-… 6.0.2… 6.0.301  false
dotnet-6.0-… 6.0.2… 6.0.203  false
dotnet-sdk   6.0.2… 6.0.301  false
dotnetcore-… 3.1.24 3.1.26   false
dotnetcore-… 3.1.4… 3.1.420  false
dotnetcore-… 3.1.4… 3.1.420  false
dotnetcore-… 3.1.24 3.1.26   false
dotnetcore-… 3.1.4… 3.1.420  false
dotnetfx     4.8.0… 4.8.0.2… false
golang       1.18.1 1.18.3   false
graphviz     2.49.3 4.0.0    false
kubernetes-… 1.24.0 1.24.1   false
Minikube     1.25.2 1.26.0   false
nodejs-lts   16.14… 16.15.1  false
powertoys    0.57.2 0.59.1   false
Temurinjre   17.0.… 18.0.1.… false
terraform    1.1.9  1.2.3    false
vcredist140  14.31… 14.32.3… false
vim          8.2.4… 9.0.0001 false
visualstudi… 2.0.2  2.0.3    false
-->
</packages>
